app/controllers/posts_controller.rb

SELECT  "authors".* FROM "authors"  ORDER BY "authors"."id" ASC LIMIT 1
INSERT INTO "posts" ("title", "description", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "My post title"], ["description", "My post description"], ["author_id", 1], ["created_at", "2019-02-02 00:27:00.903461"], ["updated_at", "2019-02-02 00:27:00.903461"]]
---
  def create
    @author = Author.first
    @post = Post.new
    @post.title = params[:title]
    @post.description = params[:description]
    @post.author_id = @author.id
    @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "My edit"], ["description", "My post description"], ["updated_at", "2015-12-31 20:39:10.987245"], ["id", 1]]
---
  def update
    @post = Post.find(params[:id])
    @post.update(title: params[:title], description: params[:description])